#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

data.oci_identity_availability_domains.ads: Reading...
oci_budget_budget.stack_budget: Refreshing state... [id=ocid1.budget.oc1.iad.amaaaaaazrydlxyarasyzmsom2pja3kuvnaiu4z54ktmzx77h35b7baosh5a]
oci_mysql_mysql_db_system.grafana_db: Refreshing state... [id=ocid1.mysqldbsystem.oc1.iad.aaaaaaaadclranruehn3mg7wd3xbfpb53bebcaz66pyz2drn6ndbphx6dw7q]
oci_core_instance.k3s_instance: Refreshing state... [id=ocid1.instance.oc1.iad.anuwcljszrydlxycucjtok26faxzdaxu5s3apmygqaej5kq7n5oh5vjxunpq]
data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-1063911866]
oci_budget_alert_rule.stack_budget_alert: Refreshing state... [id=ocid1.alertrule.oc1.iad.amaaaaaazrydlxyacdt64pnuwjp7ciqsyrffx4zffx6mcymtq5rsqwmncgzq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_load_balancer_backend.k3s_backend will be created
  + resource "oci_load_balancer_backend" "k3s_backend" {
      + backendset_name  = "k3s-backend-set"
      + backup           = false
      + drain            = (known after apply)
      + id               = (known after apply)
      + ip_address       = "10.0.0.165"
      + load_balancer_id = (known after apply)
      + max_connections  = (known after apply)
      + name             = (known after apply)
      + offline          = (known after apply)
      + port             = 80
      + state            = (known after apply)
      + weight           = (known after apply)
    }

  # oci_load_balancer_backend_set.k3s_backend_set will be created
  + resource "oci_load_balancer_backend_set" "k3s_backend_set" {
      + backend                 = (known after apply)
      + backend_max_connections = (known after apply)
      + id                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + name                    = "k3s-backend-set"
      + policy                  = "ROUND_ROBIN"
      + state                   = (known after apply)

      + health_checker {
          + interval_ms         = 10000
          + is_force_plain_text = (known after apply)
          + port                = 80
          + protocol            = "TCP"
          + response_body_regex = (known after apply)
          + retries             = 3
          + return_code         = (known after apply)
          + timeout_in_millis   = 3000
          + url_path            = (known after apply)
        }

      + lb_cookie_session_persistence_configuration (known after apply)

      + session_persistence_configuration (known after apply)
    }

  # oci_load_balancer_listener.k3s_listener_80 will be created
  + resource "oci_load_balancer_listener" "k3s_listener_80" {
      + default_backend_set_name = "k3s-backend-set"
      + hostname_names           = (known after apply)
      + id                       = (known after apply)
      + load_balancer_id         = (known after apply)
      + name                     = "http-listener"
      + port                     = 80
      + protocol                 = "HTTP"
      + rule_set_names           = (known after apply)
      + state                    = (known after apply)

      + connection_configuration (known after apply)
    }

  # oci_load_balancer_load_balancer.k3s_lb will be created
  + resource "oci_load_balancer_load_balancer" "k3s_lb" {
      + compartment_id               = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags                 = (known after apply)
      + display_name                 = "k3s-public-lb"
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + ip_address_details           = (known after apply)
      + ip_addresses                 = (known after apply)
      + ip_mode                      = (known after apply)
      + ipv6subnet_cidr              = (known after apply)
      + is_delete_protection_enabled = (known after apply)
      + is_private                   = false
      + is_request_id_enabled        = (known after apply)
      + request_id_header            = (known after apply)
      + security_attributes          = (known after apply)
      + shape                        = "flexible"
      + state                        = (known after apply)
      + subnet_ids                   = [
          + "ocid1.subnet.oc1.iad.aaaaaaaawawazjmxe3w22yttmhbewwm3pbfiagebllxucdpzejt5ddjydoqa",
        ]
      + system_tags                  = (known after apply)
      + time_created                 = (known after apply)

      + shape_details {
          + maximum_bandwidth_in_mbps = 10
          + minimum_bandwidth_in_mbps = 10
        }
    }

  # oci_waf_web_app_firewall.k3s_waf will be created
  + resource "oci_waf_web_app_firewall" "k3s_waf" {
      + backend_type               = "LOAD_BALANCER"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags               = (known after apply)
      + display_name               = "k3s-waf"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + lifecycle_details          = (known after apply)
      + load_balancer_id           = (known after apply)
      + state                      = (known after apply)
      + system_tags                = (known after apply)
      + time_created               = (known after apply)
      + time_updated               = (known after apply)
      + web_app_firewall_policy_id = (known after apply)
    }

  # oci_waf_web_app_firewall_policy.k3s_waf_policy will be created
  + resource "oci_waf_web_app_firewall_policy" "k3s_waf_policy" {
      + compartment_id    = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags      = (known after apply)
      + display_name      = "k3s-waf-policy"
      + freeform_tags     = (known after apply)
      + id                = (known after apply)
      + lifecycle_details = (known after apply)
      + state             = (known after apply)
      + system_tags       = (known after apply)
      + time_created      = (known after apply)
      + time_updated      = (known after apply)

      + actions {
          + code = (known after apply)
          + name = "ALLOW"
          + type = "ALLOW"

          + body (known after apply)

          + headers (known after apply)
        }
      + actions {
          + code = (known after apply)
          + name = "CHECK"
          + type = "CHECK"

          + body (known after apply)

          + headers (known after apply)
        }

      + request_access_control (known after apply)

      + request_protection (known after apply)

      + request_rate_limiting (known after apply)

      + response_access_control (known after apply)

      + response_protection (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + load_balancer_public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>